
This document aims to bring a developer up to speed for understanding the
/implementation/ of ~Accessor~. If you are just trying to understand how to use
it, try the [[../doc/tutorial.mdx][tutorial]] instead.

If you intend to read this document but haven't read the [[../doc/tutorial.mdx][tutorial]] yet, you
should read it first.

** 2012: Polymorphic Update with van Laarhoven Lenses

   Russell O'Connor approaches the problem of "polymorphic update".

   [[http://r6.ca/blog/20120623T104901Z.html][Polymorphic Update with van Laarhoven Lenses]]

   Suppose we have a lens that accesses the first component of a tuple:

   #+BEGIN_SRC haskell
     fstLens :: RefF (a, b) a
     fstLens = create fst (\a (_, b) -> (a, b))
   #+END_SRC

   This lens allows you to modify the value of the first component of any tuple,
   regardless of its type, so in that sense it is polymorphic. However, it does
   not allow you to change the type of the first component of a tuple.

   O'Connor noticed that if you simply omit the type signature for the
   above-defined ~create~ function, you get a more general type:

   #+BEGIN_SRC haskell
     let create get set f s = fmap (\a -> set a s) (f (get s))
     :t create
   #+END_SRC

   #+RESULTS:
   : create
   :   :: Functor f =>
   :      (t1 -> t) -> (a -> t1 -> b) -> (t -> f a) -> t1 -> f b

   Rearranging and renaming a bit, we get something that a bit more closely
   resembles the original type signature:

   #+BEGIN_SRC haskell
     (s -> a) -> (b -> s -> t) -> (forall f. Functor f => (a -> f b) -> (s -> f t))
   #+END_SRC

   Defining ~fstLens~ with this function is also more general:

   #+BEGIN_SRC haskell
     fstLens :: Functor f => (a -> f b) -> (a, c) -> f (b, c)
     fstLens = create fst (\a (_, b) -> (a, b))
   #+END_SRC

   It turns out that van Laarhoven lenses already supported polymorphism if only
   they hadn't been type constrained by hand.

